#ifndef MAINLAYER_H
#define MAINLAYER_H
 
#include "cocos2d.h"
#include "Game/Draw/Effect/Ripple/Support/RippleManager.h"
#include "Game/Scene/Sub/IScene.h"
#include "Game/Draw/Effect/Blend/AlphaBlend.h"
#include "MainState.h"
#include "Tutorial.h"

class StageManager;
class Player;


/*------------------------------------------------------------------
|		メインレイヤークラス
|	ファイル名　MainLayer.h
|	作成者　小林　大峰
------------------------------------------------------------------*/
class MainLayer : public IScene
{
public:

	/*生成マクロ*/
	CREATE_FUNC(MainLayer);

	/*-----------------------------------------------------------------------
	|	コンストラクタ
	-----------------------------------------------------------------------*/
	MainLayer(){};

	/*-----------------------------------------------------------------------
	|	デストラクタ
	-----------------------------------------------------------------------*/
	~MainLayer();

	/*-----------------------------------------------------------------------
	|	・シーン作成関数
	|	シーンとレイヤーを作成します
	-----------------------------------------------------------------------*/
	static cocos2d::Scene* createScene();

	/*-----------------------------------------------------------------------
	|	・初期化
	|	シーンの初期化(レイヤーの生成時に呼ばれる)
	-----------------------------------------------------------------------*/
	virtual bool init();

	/*----------------------------------------------------------------------
	|	・タッチ始め
	|	画面をタッチした時に呼ばれます
	|	Touch* touch  タッチ情報
	|	Event* event  イベント情報(どのデバイスで呼ばれたか)
	----------------------------------------------------------------------*/
	virtual bool onTouchBegan(cocos2d::Touch* touch, cocos2d::Event* event);

	/*----------------------------------------------------------------------
	|	・タッチ終わり
	|	画面から指を話した時に呼ばれます
	|	Touch* touch  タッチ情報
	|	Event* event  イベント情報(どのデバイスで呼ばれたか)
	----------------------------------------------------------------------*/

	virtual void onTouchEnded(cocos2d::Touch* touch, cocos2d::Event* event);

	/*----------------------------------------------------------------------
	|	・更新
	|	状態に応じて呼びだす関数を変えます（詳細はIScene.h）
	-----------------------------------------------------------------------*/
	void update(float at) override;

private:
	MainState* state;

};


#endif // __MainLayer_SCENE_H__
