#ifndef MAINSTATE_H
#define MAINSTATE_H

#include "cocos2d.h"
#include "Game/Draw/Effect/Ripple/Support/RippleManager.h"
#include "Game/Scene/Sub/IScene.h"
#include "Game/Draw/Effect/Blend/AlphaBlend.h"
#include "Tutorial.h"

class StageManager;
class Player;

/*------------------------------------------------------------------
|		メインレイヤークラス
|	ファイル名　MainState.h
|	作成者　小林　大峰
------------------------------------------------------------------*/
class MainState : public IScene
{
public:

	/*-----------------------------------------------------------------------
	|	コンストラクタ
	-----------------------------------------------------------------------*/
	MainState(Layer* layer);

	/*-----------------------------------------------------------------------
	|	デストラクタ
	-----------------------------------------------------------------------*/
	~MainState();

	/*-----------------------------------------------------------------------
	|	・初期化
	|	シーンの初期化(レイヤーの生成時に呼ばれる)
	-----------------------------------------------------------------------*/
	virtual bool init();

	/*----------------------------------------------------------------------
	|	・タッチ始め
	|	画面をタッチした時に呼ばれます
	|	Touch* touch  タッチ情報
	|	Event* event  イベント情報(どのデバイスで呼ばれたか)
	----------------------------------------------------------------------*/
	bool onTouchBegan(cocos2d::Touch* touch, cocos2d::Event* event,const Vec2& LayerPos);

	/*----------------------------------------------------------------------
	|	・タッチ終わり
	|	画面から指を話した時に呼ばれます
	|	Touch* touch  タッチ情報
	|	Event* event  イベント情報(どのデバイスで呼ばれたか)
	----------------------------------------------------------------------*/

	virtual void onTouchEnded(cocos2d::Touch* touch, cocos2d::Event* event);

	/*----------------------------------------------------------------------
	|	・更新
	|	状態に応じて呼びだす関数を変えます（詳細はIScene.h）
	-----------------------------------------------------------------------*/
	void update(float at) override;


private:
	/*------------------------------------------------------------------------
	|	・シーン初め
	------------------------------------------------------------------------*/
	void fadeIn(float at) override;

	/*------------------------------------------------------------------------
	|	・ゲームプレイ中の更新
	------------------------------------------------------------------------*/
	void sceneMain(float at) override;

	/*------------------------------------------------------------------------
	|	・シーン終わり
	------------------------------------------------------------------------*/
	void fadeOut(float at) override;


	//変数

	RenderTexture *m_Texture;
	Player* m_Player;
	AlphaBlendFunc* m_Blend;
	Scenes::Tutorial *m_Tutorial;
	StageManager* m_Manager;
	Layer*		layer;
};


#endif // __MainLayer_SCENE_H__
